<a href="https://colab.research.google.com/github/sherdonesquejo/CCDEPLRL_EXERCISES_-COM211-/blob/main/SQLAdvanced.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### **Advanced SQL**

<font color="red">File access required:</font> In Colab this notebook requires first uploading files **Cities.csv**, **Countries.csv**, **Players.csv**, and **Teams.csv** using the *Files* feature in the left toolbar. If running the notebook on a local computer, simply ensure these files are in the same workspace as the notebook.

In [105]:
!pip install prettytable==0.7.2
!pip install ipython-sql

Requirement already satisfied: prettytable==0.7.2 in /usr/local/lib/python3.10/dist-packages (0.7.2)
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.10/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.10/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (75.1.0)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: decorator in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (3.0.48)
Requirement already satisfied: pygments in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.10/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.10/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.10/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.10/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.2.13)

In [106]:
# Set-up
%load_ext sql
%sql sqlite://
import pandas as pd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [107]:
# Create database tables from CSV files
with open('Cities.csv') as f: Cities = pd.read_csv(f, index_col=0)
%sql drop table if exists Cities;
%sql --persist Cities
with open('Countries.csv') as f: Countries = pd.read_csv(f, index_col=0)
%sql drop table if exists Countries;
%sql --persist Countries

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted countries'

#### Look at sample of Cities and Countries tables

In [108]:
%%sql
select * from Cities limit 5

 * sqlite://
Done.

[('Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 ('Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 ('Abisko', 'Sweden', 63.35, 18.83, 0.2),
 ('Adana', 'Turkey', 36.99, 35.32, 18.67),
 ('Albacete', 'Spain', 39.0, -1.87, 12.62)]

In [109]:
%%sql
select * from Countries limit 5

 * sqlite://
Done.

[('Albania', 2.9, 'no', 'yes'),
 ('Andorra', 0.07, 'no', 'no'),
 ('Austria', 8.57, 'yes', 'no'),
 ('Belarus', 9.48, 'no', 'no'),
 ('Belgium', 11.37, 'yes', 'yes')]

### Duplicates, table variables

*Warm-up: Find all cities in the EU with temperature > 15*

In [110]:
%%sql
select city
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes' and temperature > 15

 * sqlite://
Done.

[('Algeciras',),
 ('Athens',),
 ('Badajoz',),
 ('Barcelona',),
 ('Bari',),
 ('Cartagena',),
 ('Catania',),
 ('Cosenza',),
 ('Granada',),
 ('Huelva',),
 ('Kalamata',),
 ('Lisbon',),
 ('Marbella',),
 ('Messina',),
 ('Palermo',),
 ('Patras',),
 ('Pescara',),
 ('Rome',),
 ('Trikala',),
 ('Valencia',)]

*Modify previous query to return EU countries that have a city with temperature > 15, remove duplicates*

In [111]:
%%sql
SELECT DISTINCT Countries.country
FROM Cities
JOIN Countries ON Cities.country = Countries.country
WHERE Countries.EU = 'yes'
  AND Cities.temperature > 15;

 * sqlite://
Done.

[('Greece',), ('Italy',), ('Portugal',), ('Spain',)]

*Find number of countries that have a city with latitude > 60 (start with country list then fix)*

In [112]:
%%sql
select country
from Cities
where latitude > 60

 * sqlite://
Done.

[('Sweden',),
 ('Norway',),
 ('Norway',),
 ('Finland',),
 ('Sweden',),
 ('Finland',),
 ('Finland',),
 ('Norway',),
 ('Finland',)]

*Modify first query to use table variables*

In [113]:
%%sql
SELECT COUNT(DISTINCT ctry.country) AS num_countries
FROM Cities cty
JOIN Countries ctry ON cty.country = ctry.country
WHERE cty.latitude > 60;

 * sqlite://
Done.

[(3,)]

In [114]:
%%sql
select city
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes' and temperature > 15

 * sqlite://
Done.

[('Algeciras',),
 ('Athens',),
 ('Badajoz',),
 ('Barcelona',),
 ('Bari',),
 ('Cartagena',),
 ('Catania',),
 ('Cosenza',),
 ('Granada',),
 ('Huelva',),
 ('Kalamata',),
 ('Lisbon',),
 ('Marbella',),
 ('Messina',),
 ('Palermo',),
 ('Patras',),
 ('Pescara',),
 ('Rome',),
 ('Trikala',),
 ('Valencia',)]

*Find all pairs of cities with the same longitude; return the city pairs and their (shared) longitude - notice what's wrong and fix it*

In [115]:
%%sql
SELECT C1.city, C2.city, C1.longitude
FROM Cities C1, Cities C2
WHERE C1.longitude = C2.longitude
  AND C1.city != C2.city;

 * sqlite://
Done.

[('Burgos', 'Madrid', -3.68),
 ('Craiova', 'Hrodna', 23.83),
 ('Hrodna', 'Craiova', 23.83),
 ('Maastricht', 'Stavanger', 5.68),
 ('Madrid', 'Burgos', -3.68),
 ('Stavanger', 'Maastricht', 5.68)]

*Find all pairs of cities that are near each other, i.e., longitude and latitude are both less than 0.5 apart; return city pairs*

In [116]:
%%sql
select C1.city, C2.city
from Cities C1, Cities C2
where abs(C1.longitude - C2.longitude) < .5
and abs(C1.latitude - C2.latitude) < .5
and C1.city < C2.city

 * sqlite://
Done.

[('Adana', 'Tarsus'),
 ('Ancona', 'Sarajevo'),
 ('Basel', 'Freiburg'),
 ('Basel', 'Mulhouse'),
 ('Bergamo', 'Milan'),
 ('Cartagena', 'Murcia'),
 ('Heidelberg', 'Karlsruhe'),
 ('Horlivka', 'Makiyivka')]

### <font color = 'green'>**Your Turn**</font>

*Find all pairs of cities with the same temperature. Return the city pairs along with their shared temperature. What do you think about the data after seeing the answer?*

In [117]:
%%sql
SELECT C1.city, C2.city, C1.temperature
FROM Cities C1, Cities C2
WHERE C1.temperature = C2.temperature
  AND C1.city != C2.city;

 * sqlite://
Done.

[('Andorra', 'Sarajevo', 9.6),
 ('Augsburg', 'Innsbruck', 4.54),
 ('Baia Mare', 'Debrecen', 8.87),
 ('Balti', 'Botosani', 8.23),
 ('Basel', 'Elblag', 6.68),
 ('Basel', 'Freiburg', 6.68),
 ('Basel', 'Mulhouse', 6.68),
 ('Basel', 'Zurich', 6.68),
 ('Bialystok', 'Hrodna', 6.07),
 ('Bonn', 'Maastricht', 8.63),
 ('Botosani', 'Balti', 8.23),
 ('Bratislava', 'Brugge', 9.65),
 ('Bratislava', 'Gyor', 9.65),
 ('Bratislava', 'Lille', 9.65),
 ('Brno', 'Vienna', 7.86),
 ('Brugge', 'Bratislava', 9.65),
 ('Brugge', 'Gyor', 9.65),
 ('Brugge', 'Lille', 9.65),
 ('Bucharest', 'Le Mans', 10.59),
 ('Bucharest', 'Ruse', 10.59),
 ('Bytom', 'Ostrava', 7.66),
 ('Chemnitz', 'Prague', 8.05),
 ('Chemnitz', 'Sivas', 8.05),
 ('Chisinau', 'Glasgow', 8.6),
 ('Craiova', 'Pleven', 10.51),
 ('Daugavpils', 'Vilnius', 5.38),
 ('Debrecen', 'Baia Mare', 8.87),
 ('Edinburgh', 'Kremenchuk', 7.43),
 ('Edirne', 'Stara Zagora', 10.9),
 ('Elblag', 'Basel', 6.68),
 ('Elblag', 'Freiburg', 6.68),
 ('Elblag', 'Mulhouse', 6.68),
 ('Elblag', 'Zurich', 6.68),
 ('Eskisehir', 'Montpellier', 11.11),
 ('Freiburg', 'Basel', 6.68),
 ('Freiburg', 'Elblag', 6.68),
 ('Freiburg', 'Mulhouse', 6.68),
 ('Freiburg', 'Zurich', 6.68),
 ('Geneva', 'Grenoble', 8.4),
 ('Glasgow', 'Chisinau', 8.6),
 ('Grenoble', 'Geneva', 8.4),
 ('Gyor', 'Bratislava', 9.65),
 ('Gyor', 'Brugge', 9.65),
 ('Gyor', 'Lille', 9.65),
 ('Hrodna', 'Bialystok', 6.07),
 ('Innsbruck', 'Augsburg', 4.54),
 ('Karlsruhe', 'Metz', 8.88),
 ('Koszalin', 'Odense', 7.73),
 ('Kremenchuk', 'Edinburgh', 7.43),
 ('Le Mans', 'Bucharest', 10.59),
 ('Le Mans', 'Ruse', 10.59),
 ('Lille', 'Bratislava', 9.65),
 ('Lille', 'Brugge', 9.65),
 ('Lille', 'Gyor', 9.65),
 ('Ljubljana', 'Rijeka', 9.27),
 ('Maastricht', 'Bonn', 8.63),
 ('Manisa', 'Rome', 15.1),
 ('Metz', 'Karlsruhe', 8.88),
 ('Montpellier', 'Eskisehir', 11.11),
 ('Mulhouse', 'Basel', 6.68),
 ('Mulhouse', 'Elblag', 6.68),
 ('Mulhouse', 'Freiburg', 6.68),
 ('Mulhouse', 'Zurich', 6.68),
 ('Nis', 'Skopje', 9.36),
 ('Novi Sad', 'Szeged', 10.34),
 ('Odense', 'Koszalin', 7.73),
 ('Ostrava', 'Bytom', 7.66),
 ('Pleven', 'Craiova', 10.51),
 ('Prague', 'Chemnitz', 8.05),
 ('Prague', 'Sivas', 8.05),
 ('Rijeka', 'Ljubljana', 9.27),
 ('Rome', 'Manisa', 15.1),
 ('Ruse', 'Bucharest', 10.59),
 ('Ruse', 'Le Mans', 10.59),
 ('Sarajevo', 'Andorra', 9.6),
 ('Sivas', 'Chemnitz', 8.05),
 ('Sivas', 'Prague', 8.05),
 ('Skopje', 'Nis', 9.36),
 ('Stara Zagora', 'Edirne', 10.9),
 ('Szeged', 'Novi Sad', 10.34),
 ('Tarsus', 'Trieste', 11.21),
 ('Trieste', 'Tarsus', 11.21),
 ('Vienna', 'Brno', 7.86),
 ('Vilnius', 'Daugavpils', 5.38),
 ('Zurich', 'Basel', 6.68),
 ('Zurich', 'Elblag', 6.68),
 ('Zurich', 'Freiburg', 6.68),
 ('Zurich', 'Mulhouse', 6.68)]

### Subqueries in Where clause

*Find all countries in the Countries table with no city in the Cities table*

In [118]:
%%sql
select country
from Countries
where not exists (select * from Cities
                  where Cities.country = Countries.country)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

*Find countries in the EU that have a city with temperature > 15*

In [119]:
%%sql
select country
from Countries
where EU = 'yes'
and exists (select * from Cities
            where Cities.country = Countries.country
            and temperature > 15)

 * sqlite://
Done.

[('Greece',), ('Italy',), ('Portugal',), ('Spain',)]

*Find number of countries that have a city with latitude > 60 (start with country list)*

In [120]:
%%sql
select country
from Countries
where exists (select * from Cities
              where Cities.country = Countries.country
              and latitude > 60)

 * sqlite://
Done.

[('Finland',), ('Norway',), ('Sweden',)]

*Find the westernmost city; return the city and longitude*

In [121]:
%%sql
select city, longitude
from Cities C1
where not exists (select * from Cities C2
                  where C2.longitude < C1.longitude)

 * sqlite://
Done.

[('Lisbon', -9.14)]

*Add easternmost to previous query*

In [122]:
%%sql
SELECT city, longitude,
       CASE
           WHEN NOT EXISTS (
               SELECT 1
               FROM Cities C2
               WHERE C2.longitude > C1.longitude
           ) THEN 'Easternmost'
           ELSE 'Not Easternmost'
       END AS position
FROM Cities C1;

 * sqlite://
Done.

[('Aalborg', 9.92, 'Not Easternmost'),
 ('Aberdeen', -2.08, 'Not Easternmost'),
 ('Abisko', 18.83, 'Not Easternmost'),
 ('Adana', 35.32, 'Not Easternmost'),
 ('Albacete', -1.87, 'Not Easternmost'),
 ('Algeciras', -5.47, 'Not Easternmost'),
 ('Amiens', 2.3, 'Not Easternmost'),
 ('Amsterdam', 4.92, 'Not Easternmost'),
 ('Ancona', 13.5, 'Not Easternmost'),
 ('Andorra', 1.52, 'Not Easternmost'),
 ('Angers', -0.53, 'Not Easternmost'),
 ('Ankara', 32.86, 'Not Easternmost'),
 ('Antalya', 30.7, 'Not Easternmost'),
 ('Arad', 21.32, 'Not Easternmost'),
 ('Athens', 23.73, 'Not Easternmost'),
 ('Augsburg', 10.9, 'Not Easternmost'),
 ('Bacau', 26.92, 'Not Easternmost'),
 ('Badajoz', -6.97, 'Not Easternmost'),
 ('Baia Mare', 23.58, 'Not Easternmost'),
 ('Balti', 27.91, 'Not Easternmost'),
 ('Barcelona', 2.18, 'Not Easternmost'),
 ('Bari', 16.87, 'Not Easternmost'),
 ('Basel', 7.59, 'Not Easternmost'),
 ('Batman', 41.14, 'Not Easternmost'),
 ('Belfast', -5.96, 'Not Easternmost'),
 ('Belgrade', 20.47, 'Not Easternmost'),
 ('Bergamo', 9.67, 'Not Easternmost'),
 ('Bergen', 5.32, 'Not Easternmost'),
 ('Berlin', 13.4, 'Not Easternmost'),
 ('Bialystok', 23.17, 'Not Easternmost'),
 ('Bielefeld', 8.53, 'Not Easternmost'),
 ('Bila Tserkva', 30.13, 'Not Easternmost'),
 ('Bilbao', -2.93, 'Not Easternmost'),
 ('Birmingham', -1.92, 'Not Easternmost'),
 ('Blackpool', -3.05, 'Not Easternmost'),
 ('Bodo', 14.4, 'Not Easternmost'),
 ('Bologna', 11.34, 'Not Easternmost'),
 ('Bonn', 7.08, 'Not Easternmost'),
 ('Bordeaux', -0.6, 'Not Easternmost'),
 ('Botosani', 26.66, 'Not Easternmost'),
 ('Bournemouth', -1.9, 'Not Easternmost'),
 ('Bradford', -1.75, 'Not Easternmost'),
 ('Braga', -8.42, 'Not Easternmost'),
 ('Braila', 27.97, 'Not Easternmost'),
 ('Bratislava', 17.12, 'Not Easternmost'),
 ('Bremen', 8.8, 'Not Easternmost'),
 ('Brest', -4.5, 'Not Easternmost'),
 ('Brest', 23.7, 'Not Easternmost'),
 ('Brno', 16.61, 'Not Easternmost'),
 ('Brugge', 3.23, 'Not Easternmost'),
 ('Bucharest', 26.1, 'Not Easternmost'),
 ('Budapest', 19.08, 'Not Easternmost'),
 ('Burgas', 27.47, 'Not Easternmost'),
 ('Burgos', -3.68, 'Not Easternmost'),
 ('Bursa', 29.07, 'Not Easternmost'),
 ('Bydgoszcz', 18.01, 'Not Easternmost'),
 ('Bytom', 18.91, 'Not Easternmost'),
 ('Caen', -0.35, 'Not Easternmost'),
 ('Cambridge', 0.12, 'Not Easternmost'),
 ('Cartagena', -0.98, 'Not Easternmost'),
 ('Catania', 15.08, 'Not Easternmost'),
 ('Chemnitz', 12.92, 'Not Easternmost'),
 ('Cherkasy', 32.07, 'Not Easternmost'),
 ('Chernihiv', 31.3, 'Not Easternmost'),
 ('Chernivtsi', 25.92, 'Not Easternmost'),
 ('Chisinau', 28.86, 'Not Easternmost'),
 ('Constanta', 28.61, 'Not Easternmost'),
 ('Cork', -8.5, 'Not Easternmost'),
 ('Cosenza', 16.29, 'Not Easternmost'),
 ('Craiova', 23.83, 'Not Easternmost'),
 ('Daugavpils', 26.51, 'Not Easternmost'),
 ('Debrecen', 21.63, 'Not Easternmost'),
 ('Denizli', 29.08, 'Not Easternmost'),
 ('Dijon', 5.03, 'Not Easternmost'),
 ('Dublin', -6.25, 'Not Easternmost'),
 ('Dundee', -3.0, 'Not Easternmost'),
 ('Edinburgh', -3.22, 'Not Easternmost'),
 ('Edirne', 26.57, 'Not Easternmost'),
 ('Elbasan', 20.08, 'Not Easternmost'),
 ('Elblag', 19.4, 'Not Easternmost'),
 ('Erfurt', 11.03, 'Not Easternmost'),
 ('Erzincan', 39.49, 'Not Easternmost'),
 ('Erzurum', 41.29, 'Not Easternmost'),
 ('Eskisehir', 30.53, 'Not Easternmost'),
 ('Exeter', -3.53, 'Not Easternmost'),
 ('Foggia', 15.56, 'Not Easternmost'),
 ('Frankfurt', 8.68, 'Not Easternmost'),
 ('Freiburg', 7.87, 'Not Easternmost'),
 ('Galway', -9.05, 'Not Easternmost'),
 ('Gaziantep', 37.38, 'Not Easternmost'),
 ('Geneva', 6.14, 'Not Easternmost'),
 ('Genoa', 8.93, 'Not Easternmost'),
 ('Glasgow', -4.25, 'Not Easternmost'),
 ('Gteborg', 12.0, 'Not Easternmost'),
 ('Granada', -3.59, 'Not Easternmost'),
 ('Graz', 15.41, 'Not Easternmost'),
 ('Grenoble', 5.72, 'Not Easternmost'),
 ('Groningen', 6.58, 'Not Easternmost'),
 ('Gyor', 17.63, 'Not Easternmost'),
 ('Heidelberg', 8.7, 'Not Easternmost'),
 ('Helsinki', 24.93, 'Not Easternmost'),
 ('Horlivka', 38.05, 'Not Easternmost'),
 ('Hrodna', 23.83, 'Not Easternmost'),
 ('Huelva', -6.93, 'Not Easternmost'),
 ('Ingolstadt', 11.45, 'Not Easternmost'),
 ('Innsbruck', 11.41, 'Not Easternmost'),
 ('Inverness', -4.23, 'Not Easternmost'),
 ('Istanbul', 29.01, 'Not Easternmost'),
 ('Kalamata', 22.11, 'Not Easternmost'),
 ('Karaman', 33.22, 'Not Easternmost'),
 ('Karlsruhe', 8.4, 'Not Easternmost'),
 ('Kaunas', 23.88, 'Not Easternmost'),
 ('Kayseri', 35.49, 'Not Easternmost'),
 ('Kherson', 32.6, 'Not Easternmost'),
 ('Kielce', 20.66, 'Not Easternmost'),
 ('Kiev', 30.52, 'Not Easternmost'),
 ('Kiruna', 20.22, 'Not Easternmost'),
 ('Klaipeda', 21.12, 'Not Easternmost'),
 ('Kosice', 21.25, 'Not Easternmost'),
 ('Koszalin', 16.18, 'Not Easternmost'),
 ('Kremenchuk', 33.43, 'Not Easternmost'),
 ('Kryvyy Rih', 33.34, 'Not Easternmost'),
 ('Le Mans', 0.1, 'Not Easternmost'),
 ('Lille', 3.08, 'Not Easternmost'),
 ('Limoges', 1.25, 'Not Easternmost'),
 ('Linz', 14.29, 'Not Easternmost'),
 ('Lisbon', -9.14, 'Not Easternmost'),
 ('Ljubljana', 14.51, 'Not Easternmost'),
 ('Lvov', 24.03, 'Not Easternmost'),
 ('Maastricht', 5.68, 'Not Easternmost'),
 ('Madrid', -3.68, 'Not Easternmost'),
 ('Magdeburg', 11.62, 'Not Easternmost'),
 ('Makiyivka', 37.97, 'Not Easternmost'),
 ('Malatya', 38.3, 'Not Easternmost'),
 ('Malm', 13.03, 'Not Easternmost'),
 ('Manisa', 27.44, 'Not Easternmost'),
 ('Marbella', -4.88, 'Not Easternmost'),
 ('Marseille', 5.38, 'Not Easternmost'),
 ('Mazyr', 29.27, 'Not Easternmost'),
 ('Messina', 15.55, 'Not Easternmost'),
 ('Metz', 6.18, 'Not Easternmost'),
 ('Milan', 9.21, 'Not Easternmost'),
 ('Minsk', 27.57, 'Not Easternmost'),
 ('Montpellier', 3.87, 'Not Easternmost'),
 ('Mulhouse', 7.35, 'Not Easternmost'),
 ('Murcia', -1.13, 'Not Easternmost'),
 ('Nice', 7.27, 'Not Easternmost'),
 ('Nis', 21.9, 'Not Easternmost'),
 ('Novi Sad', 19.85, 'Not Easternmost'),
 ('Odense', 10.38, 'Not Easternmost'),
 ('Ordu', 37.87, 'Not Easternmost'),
 ('Orsha', 30.42, 'Not Easternmost'),
 ('Oslo', 10.75, 'Not Easternmost'),
 ('Ostrava', 18.25, 'Not Easternmost'),
 ('Oulu', 25.47, 'Not Easternmost'),
 ('Oviedo', -5.83, 'Not Easternmost'),
 ('Palermo', 13.35, 'Not Easternmost'),
 ('Patras', 21.73, 'Not Easternmost'),
 ('Perpignan', 2.9, 'Not Easternmost'),
 ('Perugia', 12.39, 'Not Easternmost'),
 ('Pescara', 14.22, 'Not Easternmost'),
 ('Pinsk', 26.09, 'Not Easternmost'),
 ('Pleven', 24.61, 'Not Easternmost'),
 ('Plovdiv', 24.75, 'Not Easternmost'),
 ('Podgorica', 19.27, 'Not Easternmost'),
 ('Poznan', 16.9, 'Not Easternmost'),
 ('Prague', 14.47, 'Not Easternmost'),
 ('Reims', 4.03, 'Not Easternmost'),
 ('Riga', 24.1, 'Not Easternmost'),
 ('Rijeka', 14.45, 'Not Easternmost'),
 ('Rivne', 26.25, 'Not Easternmost'),
 ('Rome', 12.48, 'Not Easternmost'),
 ('Rostock', 12.15, 'Not Easternmost'),
 ('Ruse', 25.97, 'Not Easternmost'),
 ('Salamanca', -5.67, 'Not Easternmost'),
 ('Salzburg', 13.04, 'Not Easternmost'),
 ('Samsun', 36.34, 'Not Easternmost'),
 ('Santander', -3.8, 'Not Easternmost'),
 ('Sarajevo', 13.38, 'Not Easternmost'),
 ('Sibiu', 24.14, 'Not Easternmost'),
 ('Siirt', 41.93, 'Easternmost'),
 ('Sivas', 37.03, 'Not Easternmost'),
 ('Skopje', 21.43, 'Not Easternmost'),
 ('Split', 16.47, 'Not Easternmost'),
 ('Stara Zagora', 25.62, 'Not Easternmost'),
 ('Stavanger', 5.68, 'Not Easternmost'),
 ('Stockholm', 18.1, 'Not Easternmost'),
 ('Sumy', 34.78, 'Not Easternmost'),
 ('Swansea', -3.95, 'Not Easternmost'),
 ('Szeged', 20.15, 'Not Easternmost'),
 ('Tallinn', 24.73, 'Not Easternmost'),
 ('Tampere', 23.75, 'Not Easternmost'),
 ('Tarsus', 34.88, 'Not Easternmost'),
 ('Tartu', 26.71, 'Not Easternmost'),
 ('Tekirdag', 27.51, 'Not Easternmost'),
 ('Toulouse', 1.45, 'Not Easternmost'),
 ('Trabzon', 39.72, 'Not Easternmost'),
 ('Trieste', 13.8, 'Not Easternmost'),
 ('Trikala', 21.77, 'Not Easternmost'),
 ('Trondheim', 10.42, 'Not Easternmost'),
 ('Turku', 22.25, 'Not Easternmost'),
 ('Uppsala', 17.64, 'Not Easternmost'),
 ('Valencia', -0.4, 'Not Easternmost'),
 ('Vienna', 16.37, 'Not Easternmost'),
 ('Vigo', -8.73, 'Not Easternmost'),
 ('Vilnius', 25.32, 'Not Easternmost'),
 ('Warsaw', 21.0, 'Not Easternmost'),
 ('Wroclaw', 17.03, 'Not Easternmost'),
 ('Yevpatoriya', 33.36, 'Not Easternmost'),
 ('Zaragoza', -0.89, 'Not Easternmost'),
 ('Zhytomyr', 28.66, 'Not Easternmost'),
 ('Zonguldak', 31.78, 'Not Easternmost'),
 ('Zurich', 8.56, 'Not Easternmost')]

*Westernmost city query using = and min*

In [123]:
%%sql
select city, longitude
from Cities
where longitude = (select min(longitude) from Cities)

 * sqlite://
Done.

[('Lisbon', -9.14)]

*Find all cities whose temperature is more than 50% higher than the average; return the city, country, and temperature, ordered by descending temperature*

In [124]:
%%sql
select city, country, temperature
from Cities
where temperature > (select avg(temperature) * 1.5 from Cities)
order by temperature desc

 * sqlite://
Done.

[('Adana', 'Turkey', 18.67),
 ('Palermo', 'Italy', 17.9),
 ('Athens', 'Greece', 17.41),
 ('Algeciras', 'Spain', 17.38),
 ('Cartagena', 'Spain', 17.32),
 ('Kalamata', 'Greece', 17.3),
 ('Marbella', 'Spain', 17.19),
 ('Huelva', 'Spain', 17.09),
 ('Patras', 'Greece', 16.9),
 ('Cosenza', 'Italy', 16.6),
 ('Messina', 'Italy', 16.54),
 ('Granada', 'Spain', 16.33),
 ('Valencia', 'Spain', 16.02),
 ('Trikala', 'Greece', 16.0),
 ('Barcelona', 'Spain', 15.78),
 ('Badajoz', 'Spain', 15.61),
 ('Lisbon', 'Portugal', 15.52),
 ('Elbasan', 'Albania', 15.18),
 ('Bari', 'Italy', 15.15),
 ('Pescara', 'Italy', 15.13),
 ('Manisa', 'Turkey', 15.1),
 ('Rome', 'Italy', 15.1),
 ('Catania', 'Italy', 15.04),
 ('Denizli', 'Turkey', 15.02),
 ('Murcia', 'Spain', 15.0),
 ('Marseille', 'France', 14.98)]

*Number of cities in the EU*

In [125]:
%%sql
select count()
from Cities
where country in (select country from Countries where EU = 'yes')

 * sqlite://
Done.

[(150,)]

*Modify previous query to use "not in"*

In [126]:
%%sql
SELECT COUNT(*)
FROM Cities
WHERE country NOT IN (SELECT country FROM Countries WHERE EU = 'yes');

 * sqlite://
Done.

[(63,)]

*Same query using join instead of subquery*

In [127]:
%%sql
select count()
from Cities, Countries
where Cities.country = Countries.country
and EU = 'yes'

 * sqlite://
Done.

[(150,)]

*Number of countries with no coastline and a city with longitude < 20*

In [128]:
%%sql
select count()
from Countries
where coastline = 'no'
and exists (select * from Cities where country = Countries.country
            and longitude < 20)

 * sqlite://
Done.

[(7,)]

*Same query using join instead of subquery (see what's wrong and fix it)*

In [129]:
%%sql
SELECT COUNT(*)
FROM Countries
JOIN Cities ON Countries.country = Cities.country
WHERE Countries.coastline = 'no'
  AND Cities.longitude < 20;

 * sqlite://
Done.

[(16,)]

*Find countries in Countries table with no city in Cities table using join instead of subquery (subquery version repeated first)*

In [130]:
%%sql
select country
from Countries
where not exists (select * from Cities
                  where Cities.country = Countries.country)

 * sqlite://
Done.

[('Cyprus',), ('Iceland',), ('Kosovo',), ('Liechtenstein',), ('Luxembourg',)]

### <font color = 'green'>**Your Turn**</font>

*Find all cities in a country whose population is < 2; return the city and country. First write the query without a subquery.*

In [131]:
%%sql
SELECT Cities.city, Countries.country
FROM Cities
JOIN Countries ON Cities.country = Countries.country
WHERE Countries.population < 2;

 * sqlite://
Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

*Now write the same query using a subquery instead of a join.*

In [132]:
%%sql
SELECT city, country
FROM Cities
WHERE country IN (SELECT country FROM Countries WHERE population < 2);

 * sqlite://
Done.

[('Andorra', 'Andorra'),
 ('Daugavpils', 'Latvia'),
 ('Podgorica', 'Montenegro'),
 ('Riga', 'Latvia'),
 ('Tallinn', 'Estonia'),
 ('Tartu', 'Estonia')]

*Find all countries with no city having a temperature > 6*

In [133]:
%%sql
SELECT country
FROM Countries
WHERE country NOT IN (
    SELECT DISTINCT Cities.country
    FROM Cities
    WHERE Cities.temperature > 6
);

 * sqlite://
Done.

[('Cyprus',),
 ('Estonia',),
 ('Finland',),
 ('Iceland',),
 ('Kosovo',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Luxembourg',),
 ('Norway',)]

*Now try to write the same query without a subquery; can you?*

In [134]:
%%sql
SELECT country
FROM Countries
WHERE country NOT IN (
    SELECT DISTINCT Cities.country
    FROM Cities
    WHERE Cities.temperature > 6
);

 * sqlite://
Done.

[('Cyprus',),
 ('Estonia',),
 ('Finland',),
 ('Iceland',),
 ('Kosovo',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Luxembourg',),
 ('Norway',)]

### Aggregation with Having clause

*Find all countries with average city temperature > 10; return country and average temperature*

In [135]:
%%sql
select country, avg(temperature)
from Cities
group by country
having avg(temperature) > 10

 * sqlite://
Done.

[('Albania', 15.18),
 ('Bulgaria', 10.44),
 ('Croatia', 10.865),
 ('France', 10.151111111111112),
 ('Greece', 16.9025),
 ('Italy', 13.474666666666668),
 ('Portugal', 14.469999999999999),
 ('Spain', 14.238333333333332),
 ('Turkey', 11.726666666666665)]

*Find all countries with more than 5 cities above latitude 50*

In [136]:
%%sql
select country
from Cities
where latitude > 50
group by country
having count() > 5

 * sqlite://
Done.

[('Belarus',), ('Germany',), ('Poland',), ('Sweden',), ('United Kingdom',)]

*Same query without Having clause*

In [137]:
%%sql
select distinct country
from Cities C1
where 5 < (select count() from Cities C2
           where C1.country=C2.country
           and latitude > 50)

 * sqlite://
Done.

[('United Kingdom',), ('Sweden',), ('Germany',), ('Poland',), ('Belarus',)]

*Which combinations of EU versus non-EU and coastline versus no-coastline have a minimum population greater than 0.5?*

In [138]:
%%sql
select EU, coastline, min(population)
from Countries
group by EU, coastline
having min(population) > 0.5

 * sqlite://
Done.

[('yes', 'no', 0.58), ('yes', 'yes', 1.18)]

*Find all countries with average city temperature more than 50% higher than the overall average; return country and average temperature*

In [139]:
%%sql
select country, avg(temperature)
from Cities
group by country
having avg(temperature) > (select 1.5 * avg(temperature) from Cities)

 * sqlite://
Done.

[('Albania', 15.18), ('Greece', 16.9025), ('Portugal', 14.469999999999999)]

### <font color = 'green'>**Your Turn**</font>

*Find all countries whose average city longitude is lower than the overall average longitude, and whose average city latitude is higher than the overall average latitude. Return the countries. Note: Yes, you can use "and" in Having clauses!*

In [140]:
%%sql
SELECT country
FROM Cities
GROUP BY country
HAVING AVG(longitude) < (SELECT AVG(longitude) FROM Cities)
   AND AVG(latitude) > (SELECT AVG(latitude) FROM Cities);

 * sqlite://
Done.

[('Austria',),
 ('Belgium',),
 ('Denmark',),
 ('Germany',),
 ('Ireland',),
 ('Netherlands',),
 ('Norway',),
 ('United Kingdom',)]

### Subqueries in From and Select clauses

*Find all countries with both cold and warm cities -- at least one city with temperature < 9 and one city with temperature > 14*

In [141]:
%%sql
select distinct C1.country
from Cities C1, Cities C2
where C1.country = C2.country
and C1.temperature < 9 and C2.temperature > 14

 * sqlite://
Done.

[('France',), ('Turkey',), ('Italy',)]

*Modify query to also return count of cold and warm cities (then show without column renaming)*

In [142]:
%%sql
SELECT
    C1.country,
    (SELECT COUNT(*) FROM Cities WHERE country = C1.country AND temperature < 9),
    (SELECT COUNT(*) FROM Cities WHERE country = C1.country AND temperature > 14)
FROM Countries C1;

 * sqlite://
Done.

[('Albania', 0, 1),
 ('Andorra', 0, 0),
 ('Austria', 5, 0),
 ('Belarus', 6, 0),
 ('Belgium', 0, 0),
 ('Bosnia and Herzegovina', 0, 0),
 ('Bulgaria', 1, 0),
 ('Croatia', 0, 0),
 ('Cyprus', 0, 0),
 ('Czech Republic', 3, 0),
 ('Denmark', 2, 0),
 ('Estonia', 2, 0),
 ('Finland', 4, 0),
 ('France', 5, 1),
 ('Germany', 14, 0),
 ('Greece', 0, 4),
 ('Hungary', 1, 0),
 ('Iceland', 0, 0),
 ('Ireland', 1, 0),
 ('Italy', 1, 7),
 ('Kosovo', 0, 0),
 ('Latvia', 2, 0),
 ('Liechtenstein', 0, 0),
 ('Lithuania', 3, 0),
 ('Luxembourg', 0, 0),
 ('Macedonia', 0, 0),
 ('Moldova', 2, 0),
 ('Montenegro', 0, 0),
 ('Netherlands', 3, 0),
 ('Norway', 5, 0),
 ('Poland', 9, 0),
 ('Portugal', 0, 1),
 ('Romania', 4, 0),
 ('Serbia', 0, 0),
 ('Slovakia', 1, 0),
 ('Slovenia', 0, 0),
 ('Spain', 0, 10),
 ('Sweden', 6, 0),
 ('Switzerland', 3, 0),
 ('Turkey', 4, 5),
 ('Ukraine', 14, 0),
 ('United Kingdom', 8, 0)]

*Same query using subquery in From clause instead of Select clause*

In [143]:
%%sql
select Cold.country, numcold, numwarm
from (select country, count() as numcold from Cities
      where temperature < 9 group by country) Cold,
     (select country, count() as numwarm from Cities
      where temperature > 14 group by country) Warm
where Cold.country = Warm.country

 * sqlite://
Done.

[('France', 5, 1), ('Italy', 1, 7), ('Turkey', 4, 5)]

### Data modification

*Increase all city temperatures by 10%*

In [144]:
%%sql
update Cities
set temperature = 1.1 * temperature

 * sqlite://
213 rows affected.

[]

In [145]:
%%sql
select avg(temperature) from Cities

 * sqlite://
Done.

[(10.447624413145537,)]

*Increase temperatures another 10% for cities in countries with coastline*

In [146]:
%%sql
update Cities
set temperature = 1.1 * temperature
where country in (select country from Countries
                  where coastline = 'yes')

 * sqlite://
183 rows affected.

[]

*Delete all cities in Turkey*

In [147]:
%%sql
delete from Cities
where country = 'Turkey'

 * sqlite://
24 rows affected.

[]

*Create a new table NonEU containing list of cities (with country) not in the EU*

In [148]:
%%sql
drop table if exists NonEU;
create table NonEU(city, country);
insert into NonEU
  select city, country from cities
  where country in (select country from Countries
                    where EU = 'no');
select * from NonEU

 * sqlite://
Done.
Done.
39 rows affected.
Done.

[('Andorra', 'Andorra'),
 ('Balti', 'Moldova'),
 ('Basel', 'Switzerland'),
 ('Belgrade', 'Serbia'),
 ('Bergen', 'Norway'),
 ('Bila Tserkva', 'Ukraine'),
 ('Bodo', 'Norway'),
 ('Brest', 'Belarus'),
 ('Cherkasy', 'Ukraine'),
 ('Chernihiv', 'Ukraine'),
 ('Chernivtsi', 'Ukraine'),
 ('Chisinau', 'Moldova'),
 ('Elbasan', 'Albania'),
 ('Geneva', 'Switzerland'),
 ('Horlivka', 'Ukraine'),
 ('Hrodna', 'Belarus'),
 ('Kherson', 'Ukraine'),
 ('Kiev', 'Ukraine'),
 ('Kremenchuk', 'Ukraine'),
 ('Kryvyy Rih', 'Ukraine'),
 ('Lvov', 'Ukraine'),
 ('Makiyivka', 'Ukraine'),
 ('Mazyr', 'Belarus'),
 ('Minsk', 'Belarus'),
 ('Nis', 'Serbia'),
 ('Novi Sad', 'Serbia'),
 ('Orsha', 'Belarus'),
 ('Oslo', 'Norway'),
 ('Pinsk', 'Belarus'),
 ('Podgorica', 'Montenegro'),
 ('Rivne', 'Ukraine'),
 ('Sarajevo', 'Bosnia and Herzegovina'),
 ('Skopje', 'Macedonia'),
 ('Stavanger', 'Norway'),
 ('Sumy', 'Ukraine'),
 ('Trondheim', 'Norway'),
 ('Yevpatoriya', 'Ukraine'),
 ('Zhytomyr', 'Ukraine'),
 ('Zurich', 'Switzerland')]

*Add your city*

In [149]:
%%sql
insert into NonEU values ('Manila','Philippines');
select * from NonEU

 * sqlite://
1 rows affected.
Done.

[('Andorra', 'Andorra'),
 ('Balti', 'Moldova'),
 ('Basel', 'Switzerland'),
 ('Belgrade', 'Serbia'),
 ('Bergen', 'Norway'),
 ('Bila Tserkva', 'Ukraine'),
 ('Bodo', 'Norway'),
 ('Brest', 'Belarus'),
 ('Cherkasy', 'Ukraine'),
 ('Chernihiv', 'Ukraine'),
 ('Chernivtsi', 'Ukraine'),
 ('Chisinau', 'Moldova'),
 ('Elbasan', 'Albania'),
 ('Geneva', 'Switzerland'),
 ('Horlivka', 'Ukraine'),
 ('Hrodna', 'Belarus'),
 ('Kherson', 'Ukraine'),
 ('Kiev', 'Ukraine'),
 ('Kremenchuk', 'Ukraine'),
 ('Kryvyy Rih', 'Ukraine'),
 ('Lvov', 'Ukraine'),
 ('Makiyivka', 'Ukraine'),
 ('Mazyr', 'Belarus'),
 ('Minsk', 'Belarus'),
 ('Nis', 'Serbia'),
 ('Novi Sad', 'Serbia'),
 ('Orsha', 'Belarus'),
 ('Oslo', 'Norway'),
 ('Pinsk', 'Belarus'),
 ('Podgorica', 'Montenegro'),
 ('Rivne', 'Ukraine'),
 ('Sarajevo', 'Bosnia and Herzegovina'),
 ('Skopje', 'Macedonia'),
 ('Stavanger', 'Norway'),
 ('Sumy', 'Ukraine'),
 ('Trondheim', 'Norway'),
 ('Yevpatoriya', 'Ukraine'),
 ('Zhytomyr', 'Ukraine'),
 ('Zurich', 'Switzerland'),
 ('Manila', 'Philippines')]

### <font color = 'green'>**Your Turn - Advanced SQL on World Cup Data**</font>

In [150]:
# Create database tables from CSV files
with open('Players.csv') as f: Players = pd.read_csv(f, index_col=0)
%sql drop table if exists Players;
%sql --persist Players
with open('Teams.csv') as f: Teams = pd.read_csv(f, index_col=0)
%sql drop table if exists Teams;
%sql --persist Teams

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted teams'

#### Look at sample of Players and Teams tables

In [151]:
%%sql
select * from Players limit 5

 * sqlite://
Done.

[('Abdoun', 'Algeria', 'midfielder', 16, 0, 6, 0, 0),
 ('Belhadj', 'Algeria', 'defender', 270, 1, 146, 8, 0),
 ('Boudebouz', 'Algeria', 'midfielder', 74, 3, 28, 1, 0),
 ('Bougherra', 'Algeria', 'defender', 270, 1, 89, 11, 0),
 ('Chaouchi', 'Algeria', 'goalkeeper', 90, 0, 17, 0, 2)]

In [152]:
%%sql
select * from Teams limit 5

 * sqlite://
Done.

[('Brazil', 1, 5, 3, 1, 1, 9, 4, 7, 2),
 ('Spain', 2, 6, 5, 0, 1, 7, 2, 3, 0),
 ('Portugal', 3, 4, 1, 2, 1, 7, 1, 8, 1),
 ('Netherlands', 4, 6, 6, 0, 0, 12, 5, 15, 0),
 ('Italy', 5, 3, 0, 2, 1, 4, 5, 5, 0)]

*1) Find all pairs of teams who have the same number of goalsFor as
each other and the same number of goalsAgainst as each other.
Return the teams and numbers of goalsFor and goalsAgainst.
Make sure to return each pair only once.*

In [153]:
%%sql
SELECT
    T1.team AS team1,
    T2.team AS team2,
    T1.goalsFor,
    T1.goalsAgainst
FROM Teams T1
JOIN Teams T2
    ON T1.goalsFor = T2.goalsFor
    AND T1.goalsAgainst = T2.goalsAgainst
WHERE T1.team < T2.team;

 * sqlite://
Done.

[('Italy', 'Mexico', 4, 5),
 ('England', 'Nigeria', 3, 5),
 ('England', 'South Africa', 3, 5),
 ('Chile', 'England', 3, 5),
 ('Chile', 'Nigeria', 3, 5),
 ('Chile', 'South Africa', 3, 5),
 ('Cameroon', 'Greece', 2, 5),
 ('Australia', 'Denmark', 3, 6),
 ('Nigeria', 'South Africa', 3, 5)]

*2) Find all teams with ranking <30 where no player made more than 150 passes. Return the team and ranking.*

In [154]:
%%sql
SELECT T.team, T.ranking
FROM Teams T
WHERE T.ranking < 30
AND NOT EXISTS (
    SELECT 1
    FROM Players P
    WHERE P.team = T.team
    AND P.passes > 150
);

 * sqlite://
Done.

[('France', 9), ('Nigeria', 21), ('Switzerland', 24)]

*3) Which players made more shots than 5x the overall average number of shots? Return the player surname, position, and team.*

In [155]:
%%sql
SELECT P.surname, P.position, P.team
FROM Players P
WHERE P.shots > 5 * (SELECT AVG(shots) FROM Players);

 * sqlite://
Done.

[('Higuain', 'forward', 'Argentina'),
 ('Messi', 'forward', 'Argentina'),
 ('Podolski', 'forward', 'Germany'),
 ('Boateng', 'midfielder', 'Ghana'),
 ('Gyan', 'forward', 'Ghana'),
 ('Sneijder', 'midfielder', 'Netherlands'),
 ('van Persie', 'forward', 'Netherlands'),
 ('Jong Tae-Se', 'forward', 'North Korea'),
 ('Ronaldo', 'forward', 'Portugal'),
 ('Park Chu-Young', 'forward', 'South Korea'),
 ('Villa', 'forward', 'Spain'),
 ('Forlan', 'forward', 'Uruguay'),
 ('Suarez', 'forward', 'Uruguay'),
 ('Dempsey', 'midfielder', 'USA')]

*4) Find all team-position pairs where the average number of passes made by players in that position on that team is greater than 150. Return the team-position pairs.*

In [156]:
%%sql
SELECT P.team, P.position
FROM Players P
GROUP BY P.team, P.position
HAVING AVG(P.passes) > 150;

 * sqlite://
Done.

[('Argentina', 'midfielder'),
 ('Brazil', 'defender'),
 ('Germany', 'defender'),
 ('Germany', 'midfielder'),
 ('Ghana', 'midfielder'),
 ('Mexico', 'defender'),
 ('Netherlands', 'defender'),
 ('Netherlands', 'midfielder'),
 ('Spain', 'defender'),
 ('Spain', 'midfielder')]

*5) Find all teams whose defenders averaged more than 150 passes. Return the team and average number of passes by defenders, in descending order of average passes.*

In [157]:
%%sql
SELECT P.team, AVG(P.passes) AS avg_passes
FROM Players P
WHERE P.position = 'defender'
GROUP BY P.team
HAVING AVG(P.passes) > 150
ORDER BY avg_passes DESC;

 * sqlite://
Done.

[('Spain', 213.0),
 ('Brazil', 190.0),
 ('Germany', 189.83333333333334),
 ('Netherlands', 182.5),
 ('Mexico', 152.14285714285714)]

### <font color = 'green'>**Your Turn Extra - Advanced SQL on Titanic Data**</font>

<font color="red">File access required:</font> In Colab these extra problems require first uploading **Titanic.csv** using the *Files* feature in the left toolbar. If running the notebook on a local computer, simply ensure this file is in the same workspace as the notebook.

In [158]:
# Load dataabase table from CSV file
with open('Titanic.csv') as f: Titanic = pd.read_csv(f, index_col=0)
%sql drop table if exists Titanic;
%sql --persist Titanic

 * sqlite://
Done.
 * sqlite://

'Persisted titanic'

#### Look at sample of Titanic table

In [159]:
%%sql
select * from Titanic limit 5

 * sqlite://
Done.

[('Abbing', 'Mr. Anthony', 'M', 42.0, 3, 7.55, 'Southampton', 'no'),
 ('Abbott', 'Mrs. Stanton (Rosa Hunt)', 'F', 35.0, 3, 20.25, 'Southampton', 'yes'),
 ('Abbott', 'Mr. Rossmore Edward', 'M', 16.0, 3, 20.25, 'Southampton', 'no'),
 ('Abelson', 'Mr. Samuel', 'M', 30.0, 2, 24.0, 'Cherbourg', 'no'),
 ('Abelson', 'Mrs. Samuel (Hannah Wizosky)', 'F', 28.0, 2, 24.0, 'Cherbourg', 'yes')]

*1) Find pairs of passengers who are likely to be twin children: same last name, same age, same embarkation, and age is under 18. Return each pair once, including their last name, first names, age, and embarkation city.*

In [160]:
%%sql
SELECT P1.last, P1.first AS first_name_1, P1.age AS age_1, P1.embarked AS embarkation_1,
       P2.first AS first_name_2, P2.age AS age_2, P2.embarked AS embarkation_2
FROM Titanic P1
JOIN Titanic P2
  ON P1.last = P2.last
  AND P1.age = P2.age
  AND P1.embarked = P2.embarked
  AND P1.age < 18
  AND P2.age < 18
  AND P1.first != P2.first
ORDER BY P1.last, P1.age, P1.embarked;

 * sqlite://
Done.

[('Baclini', 'Miss Helene Barbara', 0.75, 'Cherbourg', 'Miss Eugenie', 0.75, 'Cherbourg'),
 ('Baclini', 'Miss Eugenie', 0.75, 'Cherbourg', 'Miss Helene Barbara', 0.75, 'Cherbourg'),
 ('Calic', 'Mr. Jovo', 17.0, 'Southampton', 'Mr. Petar', 17.0, 'Southampton'),
 ('Calic', 'Mr. Petar', 17.0, 'Southampton', 'Mr. Jovo', 17.0, 'Southampton')]

*2) Which embarkation cities have more than 40 passengers whose age is missing? Reminder: Blanks in SQL tables are given a special value called 'null', and conditions 'A is null' and 'A is not null' can be used in Where clauses to check whether attribute A has the 'null' value.*

In [161]:
%%sql
SELECT embarked, COUNT(*) AS missing_age_count
FROM Titanic
WHERE age IS NULL
GROUP BY embarked
HAVING COUNT(*) > 40;

 * sqlite://
Done.

[('Queenstown', 49), ('Southampton', 90)]

*3) Find all classes where the average fare paid by passengers in that class was more than twice the overall average or less than half the overall average.*

In [162]:
%%sql
SELECT class, AVG(fare) AS avg_fare
FROM Titanic
GROUP BY class
HAVING AVG(fare) > 2 * (SELECT AVG(fare) FROM Titanic)
   OR AVG(fare) < 0.5 * (SELECT AVG(fare) FROM Titanic);

 * sqlite://
Done.

[(1, 84.15499999999999), (3, 13.676863543788176)]

*4) What is the average number of passengers per last name? Hint: Requires using a subquery in the From clause*

In [163]:
%%sql
SELECT AVG(passenger_count) AS avg_passengers_per_lastname
FROM (
    SELECT last, COUNT(*) AS passenger_count
    FROM Titanic
    GROUP BY last
) AS last_name_counts;

 * sqlite://
Done.

[(1.3358320839580209,)]

*5) List each class and its survival rate, i.e., the fraction of passengers in that class who survived. Hints: Use subqueries in the From clause to compute the number of survivers per class and total passengers per class, and force floating point division by multiplying one operand by 1.0*

In [164]:
%%sql
SELECT class,
       survived_count * 1.0 / total_count AS survival_rate
FROM (
    SELECT class,
           COUNT(CASE WHEN survived = 1 THEN 1 END) AS survived_count,
           COUNT(*) AS total_count
    FROM Titanic
    GROUP BY class
) AS class_survival_data;

 * sqlite://
Done.

[(1, 0.0), (2, 0.0), (3, 0.0)]

*6) Modify your previous query to return the survival rate by gender, i.e., of females and of males.*

In [165]:
%%sql
SELECT class, gender,
       survived_count * 1.0 / total_count AS survival_rate
FROM (
    SELECT class, gender,
           COUNT(CASE WHEN survived = 1 THEN 1 END) AS survived_count,
           COUNT(*) AS total_count
    FROM Titanic
    GROUP BY class, gender
) AS class_gender_survival_data;

 * sqlite://
Done.

[(1, 'F', 0.0),
 (1, 'M', 0.0),
 (2, 'F', 0.0),
 (2, 'M', 0.0),
 (3, 'F', 0.0),
 (3, 'M', 0.0)]

*7) Now return the survival rate of children versus adults, i.e., of passengers under age 18 versus those 18 or over (ignoring passengers whose age is missing).*

In [166]:
%%sql
SELECT age_group,
       survived_count * 1.0 / total_count AS survival_rate
FROM (
    SELECT CASE
               WHEN age < 18 THEN 'Child'
               WHEN age >= 18 THEN 'Adult'
               ELSE 'Unknown'
           END AS age_group,
           COUNT(CASE WHEN survived = 1 THEN 1 END) AS survived_count,
           COUNT(*) AS total_count
    FROM Titanic
    WHERE age IS NOT NULL
    GROUP BY age_group
) AS age_group_survival_data;

 * sqlite://
Done.

[('Adult', 0.0), ('Child', 0.0)]

### <font color = 'green'>**Your Turn Extra - SQL Data Modification on Titanic Data**</font>

In [167]:
# Reload table from CSV file
# NOTE: You may want to reload frequently to reset the data as you
# experiment with modifications
with open('Titanic.csv') as f: Titanic = pd.read_csv(f, index_col=0)
%sql drop table if exists Titanic;
%sql persist Titanic

 * sqlite://
Done.
 * sqlite://
(sqlite3.OperationalError) near "persist": syntax error
[SQL: persist Titanic]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

*1) Subtract 5 from the fare paid by any passenger under the age of 10. Then compute the new average fare. NOTE: You can put multiple SQL statements in one cell separated by a semicolon.*

In [168]:
%%sql
YOUR CODE HERE

 * sqlite://
(sqlite3.OperationalError) near "YOUR": syntax error
[SQL: YOUR CODE HERE]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

*2) Create a new table called Survivors, containing the last and first names of all passengers who survived. Then count the number of tuples in the new table.*

In [169]:
%%sql
YOUR CODE HERE

 * sqlite://
(sqlite3.OperationalError) near "YOUR": syntax error
[SQL: YOUR CODE HERE]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

*3) In the Titanic table delete all but the highest-paying passengers.*

In [170]:
%%sql
YOUR CODE HERE

 * sqlite://
(sqlite3.OperationalError) near "YOUR": syntax error
[SQL: YOUR CODE HERE]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

*4) In what's left of the table after (3), insert a new tuple for yourself. You can decide your class, fare, where you embarked, and whether you survived. Then show the whole table.*

In [171]:
%%sql
YOUR CODE HERE

 * sqlite://
(sqlite3.OperationalError) near "YOUR": syntax error
[SQL: YOUR CODE HERE]
(Background on this error at: https://sqlalche.me/e/20/e3q8)